<a href="https://colab.research.google.com/github/havigowda9625/AIML-DS-/blob/main/Pandas_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
import pandas as pd

In [9]:
pds=pd.read_excel("/content/Sample - Superstore.xls")

In [10]:
# Question 1: Find total number of orders in the dataset.
pds['Order ID'].unique()

array(['CA-2016-152156', 'CA-2016-138688', 'US-2015-108966', ...,
       'CA-2014-110422', 'CA-2017-121258', 'CA-2017-119914'], dtype=object)

In [11]:
# Question 2: Find the earliest order date.
pds['Order Date'].min()

Timestamp('2014-01-03 00:00:00')

In [12]:
# Question 3: Find the latest order date.
pds['Order Date'].max()

Timestamp('2017-12-30 00:00:00')

In [13]:
# Question 4: Find the total number of unique customers.
N=pds['Customer Name'].unique()
M=len(N)
M

793

In [14]:
# Question 5: Find the total number of unique products sold.
pd.Series(pds['Product ID'].unique())

0       FUR-BO-10001798
1       FUR-CH-10000454
2       OFF-LA-10000240
3       FUR-TA-10000577
4       OFF-ST-10000760
             ...
1857    TEC-PH-10002817
1858    TEC-MA-10003589
1859    OFF-AP-10003099
1860    TEC-PH-10002645
1861    OFF-ST-10001627
Length: 1862, dtype: object

In [15]:
# Question 6: Find the total number of unique categories.
pd.Series(pds['Category'].unique())

0          Furniture
1    Office Supplies
2         Technology
dtype: object

In [16]:
# Question 7: Find the total number of unique sub-categories.
pd.Series(pds['Sub-Category'].unique())

0       Bookcases
1          Chairs
2          Labels
3          Tables
4         Storage
5     Furnishings
6             Art
7          Phones
8         Binders
9      Appliances
10          Paper
11    Accessories
12      Envelopes
13      Fasteners
14       Supplies
15       Machines
16        Copiers
dtype: object

In [17]:
# Question 8: Count number of orders in each region.
pds['Region'].value_counts()

Region
West       3203
East       2848
Central    2323
South      1620
Name: count, dtype: int64

In [18]:
# Question 9: Count number of orders by state.
pds['State'].value_counts()

State
California              2001
New York                1128
Texas                    985
Pennsylvania             587
Washington               506
Illinois                 492
Ohio                     469
Florida                  383
Michigan                 255
North Carolina           249
Arizona                  224
Virginia                 224
Georgia                  184
Tennessee                183
Colorado                 182
Indiana                  149
Kentucky                 139
Massachusetts            135
New Jersey               130
Oregon                   124
Wisconsin                110
Maryland                 105
Delaware                  96
Minnesota                 89
Connecticut               82
Missouri                  66
Oklahoma                  66
Alabama                   61
Arkansas                  60
Rhode Island              56
Utah                      53
Mississippi               53
South Carolina            42
Louisiana                 42
Nevada                    39
Nebraska                  38
New Mexico                37
Iowa                      30
New Hampshire             27
Kansas                    24
Idaho                     21
Montana                   15
South Dakota              12
Vermont                   11
District of Columbia      10
Maine                      8
North Dakota               7
West Virginia              4
Wyoming                    1
Name: count, dtype: int64

In [19]:
# Question 10: Count number of orders by city.
pds['City'].value_counts()

City
New York City    915
Los Angeles      747
Philadelphia     537
San Francisco    510
Seattle          428
                ...
Abilene            1
Montebello         1
Kissimmee          1
Danbury            1
Springdale         1
Name: count, Length: 531, dtype: int64

In [20]:
# Question 11: Find the most common ship mode.
N=pds['Ship Mode'].max()
N

'Standard Class'

In [21]:
# Question 12: Find the least common ship mode.
M=pds['Ship Mode'].min()
M

'First Class'

In [22]:
# Question 13: Count number of orders shipped with "Same Day" mode.
N=pds['Ship Mode'].value_counts()['Same Day']
N

np.int64(543)

In [23]:
# Question 14: Count number of orders shipped with "First Class".
M=pds['Ship Mode'].value_counts()['First Class']
M

np.int64(1538)

In [24]:
# Question 15: Count number of orders shipped with "Second Class".
M=pds['Ship Mode'].value_counts()['Second Class']
M

np.int64(1945)

In [25]:
# Question 16: Count number of orders shipped with "Standard Class".
M=pds['Ship Mode'].value_counts()['Standard Class']
M

np.int64(5968)

In [26]:
# Question 17: Find number of orders in each year.
M=pds['Order Date'].dt.year.value_counts()
M

Order Date
2017    3312
2016    2587
2015    2102
2014    1993
Name: count, dtype: int64

In [27]:
# Question 18: Find number of orders in each quarter.
M=pds['Order Date'].dt.quarter.value_counts()
M

Order Date
4    3698
3    2799
2    2120
1    1377
Name: count, dtype: int64

In [28]:
# Question 19: Find number of orders in each month.
M=pds['Order Date'].dt.month.value_counts()
M

Order Date
11    1471
12    1408
9     1383
10     819
5      735
6      717
7      710
8      706
3      696
4      668
1      381
2      300
Name: count, dtype: int64

In [29]:
# Question 20: Find number of orders in each weekday.
M=pds['Order Date'].dt.weekday.value_counts()
M

Order Date
0    1871
4    1818
6    1710
5    1655
3    1463
1    1106
2     371
Name: count, dtype: int64

In [32]:
# Question 21: Count orders with discount applied.
da=pds['Discount'].apply(lambda x:x>0).sum()
da

np.int64(5196)

In [33]:
# Question 22: Count orders without discount.
da=pds['Discount'].apply(lambda x:x<0).sum()
da

np.int64(0)

In [34]:
# Question 23: Count orders where discount = 0.
da=pds['Discount'].apply(lambda x:x==0).sum()
da

np.int64(4798)

In [35]:
# Question 24: Count orders where discount > 0.2.
da=pds['Discount'].apply(lambda x:x>0.2).sum()
da

np.int64(1393)

In [36]:
# Question 25: Count orders where discount = 0.5.
da=pds['Discount'].apply(lambda x:x>0.5).sum()
da

np.int64(856)

In [38]:
# Question 26: Find maximum discount given.
da=pds['Discount'].max()
da

0.8

In [39]:
# Question 27: Find minimum discount given.
da=pds['Discount'].min()
da

0.0

In [40]:
# Question 28: Count orders where profit < 0.
p=pds['Profit'].apply(lambda x:x<0).sum()
p

np.int64(1871)

In [42]:
# Question 29: Count orders where profit = 0.
p=pds['Profit'].apply(lambda x:x==0).sum()
p

np.int64(65)

In [43]:
# Question 30: Count orders where profit > 100.
p=pds['Profit'].apply(lambda x:x>100).sum()
p

np.int64(890)

In [45]:
# Question 31: Count orders where sales > 1000.
s=pds['Sales'].apply(lambda x:x>1000).sum()
s

np.int64(468)

In [46]:
# Question 32: Find total quantity sold.
s=pds['Quantity'].sum()
s

np.int64(37873)

In [50]:
# Question 33: Find average quantity per order.
aq=pds['Order ID'].value_counts().sum()
aq

np.int64(9994)

In [52]:
# Question 34: Find average sales per order.
pds['Sales'].value_counts().sum()

np.int64(9994)

In [53]:
# Question 35: Find average profit per order.
pds['Profit'].value_counts().sum()

np.int64(9994)

In [57]:
# Question 36: Find maximum sales in a single order.
ms=pds.groupby('Order ID')['Sales'].sum().max()
ms

23661.228

In [58]:
# Question 37: Find minimum sales in a single order.
ms=pds.groupby('Order ID')['Sales'].sum().min()
ms

0.5559999999999998

In [59]:
# Question 38: Find maximum profit in a single order.
mp=pds.groupby('Order ID')['Profit'].sum().max()
mp

8762.389099999999

In [60]:
# Question 39: Find minimum profit in a single order.
mp=pds.groupby('Order ID')['Profit'].sum().min()
mp

-6892.3748000000005

In [62]:
# Question 40: Find number of orders per customer.
nop=pds.groupby('Order ID')['Customer ID'].sum().value_counts()
nop

Customer ID
EP-13915                                    9
EB-13870                                    9
GM-14500                                    8
SZ-20035                                    8
BM-11785                                    8
                                           ..
JE-16165                                    1
CC-12370CC-12370                            1
AB-10600AB-10600AB-10600AB-10600AB-10600    1
DP-13000DP-13000DP-13000                    1
FM-14290FM-14290FM-14290FM-14290FM-14290    1
Name: count, Length: 2380, dtype: int64

In [ ]:
# Question 41: Find customers who placed only 1 order.

In [ ]:
# Question 42: Find customers who placed more than 10 orders.

In [ ]:
# Question 43: Find total number of states represented.

In [ ]:
# Question 44: Find total number of cities represented.

In [ ]:
# Question 45: Find number of orders placed from California.

In [ ]:
# Question 46: Find number of orders placed from New York.

In [ ]:
# Question 47: Find number of orders placed from Texas.

In [ ]:
# Question 48: Find number of orders placed from Florida.

In [ ]:
# Question 49: Find number of orders shipped after 5 days of order.

In [ ]:
# Question 50: Find average shipping time in days.